posts/2013-08-08-why-iostring-NEQ-string-in-haskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-06 Sat 01:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why IOString != String In Haskell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Xin Huang" />
<link rel="stylesheet" href="/themes/github/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Why IOString != String In Haskell</h1>
<p>
In GHCi, I want to test my <code>headRev</code> function, while loading Mercurial log from a file and pass the content to the <code>headRev</code> function:
</p>

<div class="org-src-container">
<pre class="src src-haskell">log = readFile "hg.log"
headRev log
</pre>
</div>

<p>
I get a error message complaining "IO String is not [Char]":
</p>

<blockquote>
<p>
Couldn't match expected type <code>[Char]</code> with actual type <code>IOString</code> In
the first argument of `headRev`, namely `log` In the expression:
headRev log In an equation for <code>it</code>: <code>it = headRev log</code>
</p>
</blockquote>

<p>
Why <code>IOString</code> is not compatible with <code>String</code>? Why is it designed like this?
After googled the error, here is a insightful reason to this question.
</p>

<blockquote>
<p>
There is a very good reason why there is no such function.
</p>

<p>
Haskell has the notion of functional purity. This means that a
function will always return the same result when called with the same
parameters. The only place where IO is allowed is inside the IO Monad. <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</blockquote>


<p>
And BTW how to "walk" around it while you want to test in GHCi? I'm doing it this way:
</p>

<p>
Define <code>interactWith</code> function in source code, compile, and load via <code>:l *hgrev</code>
</p>

<blockquote>
<p>
interactWith function [inputFile] = do
    input &lt;- readFile inputFile
    putStrLn (function input)
</p>
</blockquote>

<p>
Then in GHCi:
</p>

<blockquote>
<p>
let f log = headRev (lines log)
interactWith f "hg.log"
</p>
</blockquote>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://stackoverflow.com/a/1676052/2190129">http://stackoverflow.com/a/1676052/2190129</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="/" class="left">Home</a><a href="#" class="right">Top</a>
</div>
</body>
</html>
